let table_config = {
  //画布id
  bindto: '#table',
  //svg大小
  // size: {
  //   width: '800', //1080
  //   height: '200' //600
  // },
  //除了标签之外图表中其他元素的字体
  font: {
    size: 12,
    color: '#424242'
  },
  tooltip: {
    show: true
  },
  color: {
    //每个aggression所应用的色板[[], [], ...]
    schemes: [],
    //每个aggression的透明度[1, 0.9, 0.6,...]
    opacity: [],
  },
  data: {
    //当combined已有数据时json数组可为空
    json: [{'sum(销售数量)': 797959, 'sum(销售金额)': 29137857.229999926, 产品主类: "彩妆", 品牌: "无品牌信息"},
    {'sum(销售数量)': 2848244, 'sum(销售金额)': 156681327.89000332, 产品主类: "彩妆", 品牌: "国际品牌"},
    {'sum(销售数量)': 172295, 'sum(销售金额)': 2358534.489999993, 产品主类: "彩妆", 品牌: "国内品牌"},
    {'sum(销售数量)': 363528, 'sum(销售金额)': 1594013.0999999996, 产品主类: "儿童", 品牌: "无品牌信息"},
    {'sum(销售数量)': 605053, 'sum(销售金额)': 6952265.899999972, 产品主类: "儿童", 品牌: "国际品牌"},
    {'sum(销售数量)': 49058, 'sum(销售金额)': 381666.37999999983, 产品主类: "儿童", 品牌: "国内品牌"},
    {'sum(销售数量)': 150734, 'sum(销售金额)': 1439978.7799999996, 产品主类: "化妆工具", 品牌: "无品牌信息"},
    {'sum(销售数量)': 114052, 'sum(销售金额)': 1448612.1600000006, 产品主类: "化妆工具", 品牌: "国际品牌"},
    {'sum(销售数量)': 102256, 'sum(销售金额)': 969937.1700000004, 产品主类: "化妆工具", 品牌: "国内品牌"},
    {'sum(销售数量)': 1753848, 'sum(销售金额)': 14534142.900000066, 产品主类: "居家日用", 品牌: "无品牌信息"},
    {'sum(销售数量)': 2336088, 'sum(销售金额)': 25631851.750000045, 产品主类: "居家日用", 品牌: "国际品牌"},
    {'sum(销售数量)': 451322, 'sum(销售金额)': 5023255.579999978, 产品主类: "居家日用", 品牌: "国内品牌"},
    {'sum(销售数量)': 277595, 'sum(销售金额)': 2840436.7499999986, 产品主类: "服饰", 品牌: "无品牌信息"},
    {'sum(销售数量)': 23656, 'sum(销售金额)': 650437.1100000007, 产品主类: "服饰", 品牌: "国际品牌"},
    {'sum(销售数量)': NaN, 'sum(销售金额)': NaN, 产品主类: "服饰", 品牌: "国内品牌"}],
    //颜色对象，包括feature, type, stacked这些key (该属性柱、线、或其组合不可用)
    colored: {},
    //标签数组 (该属性柱、线、或其组合不可用)
    labeled: ['sum(销售数量)', 'sum(销售金额)'],
    //用户自定义颜色或大小范围
    range: {
      //每个aggression所对应的颜色范围[[], [], ...]，颜色为渐变时有
      color: [],
    },
    //行列数据
    column: {
      categories: ['产品主类'],
      aggressions: []
    },
    row: {
      categories: ['品牌'],
      aggressions: []
    },
  },
  //table
  table: {
    //外边框
    outter: {
      color: '#424242',
      width: 2
    },
    //内边框
    inner: {
      color: '#a4a4a4',
      width: 1
    },
    //边距
    padding: {
      top: 0, left: 0, bottom: 0, right: 5
    },
    //表头
    header: {
      top: {
        height: 35
      },
      left: {
        width: 100,
      },
      auto: true
    },
    //cell
    body: {
      width: 150,
      height: 24
    }
  },
}
let table_config1 = {
  //画布id
  bindto: '#table1',
  //svg大小
  size: {
    width: '600', //1080
    height: '200' //600
  },
  //除了标签之外图表中其他元素的字体
  font: {
    size: 12,
    color: '#424242'
  },
  tooltip: {
    show: true
  },
  color: {
    //每个aggression所应用的色板[[], [], ...]
    schemes: [],
    //每个aggression的透明度[1, 0.9, 0.6,...]
    opacity: [],
  },
  data: {
    //当combined已有数据时json数组可为空
    json: [{'sum(销售金额)': 17791579.170000087, 产品主类: "个人护理", 是否为国际品牌: "无品牌信息"},
    {'sum(销售数量)': 1293674, 产品主类: "个人护理", 是否为国际品牌: "无品牌信息"},
    {'sum(销售金额)': 108189394.6200009, 产品主类: "个人护理", 是否为国际品牌: "非国际品牌"},
    {'sum(销售数量)': 6132274, 产品主类: "个人护理", 是否为国际品牌: "非国际品牌"},
    {'sum(销售金额)': 950658.8900000016, 产品主类: "个人护理", 是否为国际品牌: "国际品牌"},
    {'sum(销售数量)': 212077, 产品主类: "个人护理", 是否为国际品牌: "国际品牌"},
    {'sum(销售金额)': 65696267.98999998, 产品主类: "护肤品", 是否为国际品牌: "无品牌信息"},
    {'sum(销售数量)': 914901,  产品主类: "护肤品", 是否为国际品牌: "无品牌信息"},
    {'sum(销售金额)': 258500804.47001073, 产品主类: "护肤品", 是否为国际品牌: "非国际品牌"},
    {'sum(销售数量)': 4296106, 产品主类: "护肤品", 是否为国际品牌: "非国际品牌"},
    {'sum(销售金额)': 661920.4000000011, 产品主类: "护肤品", 是否为国际品牌: "国际品牌"},
    {'sum(销售数量)': 49246, 产品主类: "护肤品", 是否为国际品牌: "国际品牌"},
    {'sum(销售金额)': 29137857.229999926, 产品主类: "彩妆", 是否为国际品牌: "无品牌信息"},
    {'sum(销售数量)': 797959, 产品主类: "彩妆", 是否为国际品牌: "无品牌信息"},
    {'sum(销售金额)': 156681327.89000332, 产品主类: "彩妆", 是否为国际品牌: "非国际品牌"},
    {'sum(销售数量)': 2848244, 产品主类: "彩妆", 是否为国际品牌: "非国际品牌"},
    {'sum(销售金额)': 2358534.489999993, 产品主类: "彩妆", 是否为国际品牌: "国际品牌"},
    {'sum(销售数量)': 172295, 产品主类: "彩妆", 是否为国际品牌: "国际品牌"}],
    //颜色对象，包括feature, type, stacked这些key (该属性柱、线、或其组合不可用)
    colored: {},
    //标签数组 (该属性柱、线、或其组合不可用)
    labeled: [],
    //用户自定义颜色或大小范围
    range: {
      //每个aggression所对应的颜色范围[[], [], ...]，颜色为渐变时有
      color: [],
    },
    //行列数据
    column: {
      categories: ['产品主类'],
      aggressions: []
    },
    row: {
      categories: ['是否为国际品牌'],
      aggressions: ['sum(销售金额)', 'sum(销售数量)']
    },
  },
  //table
  table: {
    //外边框
    outter: {
      color: '#424242',
      width: 2
    },
    //内边框
    inner: {
      color: '#a4a4a4',
      width: 1
    },
    //边距
    padding: {
      top: 0, left: 0, bottom: 0, right: 5
    },
    //表头
    header: {
      top: {
        height: 35
      },
      left: {
        width: 100,
      },
      auto: false
    },
    //cell
    body: {
      width: 90,
      height: 24
    }
  },
}
let table_config2 = {
  //画布id
  bindto: '#table2',
  //svg大小
  size: {
    width: '800', //1080
    height: '150' //600
  },
  //除了标签之外图表中其他元素的字体
  font: {
    size: 12,
    color: '#424242'
  },
  tooltip: {
    show: true
  },
  color: {
    //每个aggression所应用的色板[[], [], ...]
    schemes: [],
    //每个aggression的透明度[1, 0.9, 0.6,...]
    opacity: [],
  },
  data: {
    //当combined已有数据时json数组可为空
    json: [{'sum(销售金额)': 29137857.229999926, 产品主类: "彩妆"},
    {'sum(销售数量)': 797959, 产品主类: "彩妆"},
    {'sum(销售金额)': 1594013.0999999996, 产品主类: "儿童"},
    {'sum(销售数量)': 363528, 产品主类: "儿童"},
    {'sum(销售金额)': 1439978.7799999996, 产品主类: "化妆工具"},
    {'sum(销售数量)': 150734, 产品主类: "化妆工具"},
    {'sum(销售金额)': 14534142.900000066, 产品主类: "居家日用"},
    {'sum(销售数量)': 1753848, 产品主类: "居家日用"},
    {'sum(销售金额)': 2840436.7499999986, 产品主类: "服饰"},
    {'sum(销售数量)': 277595, 产品主类: "服饰"}],
    //颜色对象，包括feature, type, stacked这些key (该属性柱、线、或其组合不可用)
    colored: {},
    //标签数组 (该属性柱、线、或其组合不可用)
    labeled: [],
    //用户自定义颜色或大小范围
    range: {
      //每个aggression所对应的颜色范围[[], [], ...]，颜色为渐变时有
      color: [],
    },
    //行列数据
    column: {
      categories: ['产品主类'],
      aggressions: []
    },
    row: {
      categories: [],
      aggressions: ['sum(销售金额)', 'sum(销售数量)']
    },
  },
  //table
  table: {
    //外边框
    outter: {
      color: '#424242',
      width: 2
    },
    //内边框
    inner: {
      color: '#a4a4a4',
      width: 1
    },
    //边距
    padding: {
      top: 0, left: 0, bottom: 0, right: 5
    },
    //表头
    header: {
      top: {
        height: 35
      },
      left: {
        width: 100,
      },
      auto: false
    },
    //cell
    body: {
      width: 90,
      height: 24
    }
  },
}
let table_config3 = {
  //画布id
  bindto: '#table3',
  //svg大小
  size: {
    width: '1350', //1080
    height: '250' //600
  },
  //除了标签之外图表中其他元素的字体
  font: {
    size: 12,
    color: '#424242'
  },
  tooltip: {
    show: true
  },
  color: {
    //每个aggression所应用的色板[[], [], ...]
    schemes: [],
    //每个aggression的透明度[1, 0.9, 0.6,...]
    opacity: [],
  },
  data: {
    //当combined已有数据时json数组可为空
    json: [{'sum(销售金额)': 29137857.229999926, 产品主类: "彩妆", 品牌: 'AAA'},
    {'sum(销售金额)': 797959, 产品主类: "彩妆", 品牌: 'BBB'},
    {'sum(销售金额)': 1594013.0999999996, 产品主类: "儿童", 品牌: 'AAA'},
    {'sum(销售金额)': 363528, 产品主类: "儿童", 品牌: 'BBB'},
    {'sum(销售金额)': 1439978.7799999996, 产品主类: "化妆工具", 品牌: 'AAA'},
    {'sum(销售金额)': 150734, 产品主类: "化妆工具", 品牌: 'BBB'},
    {'sum(销售金额)': 14534142.900000066, 产品主类: "居家日用", 品牌: 'AAA'},
    {'sum(销售金额)': 1753848, 产品主类: "居家日用", 品牌: 'BBB'},
    {'sum(销售金额)': 2840436.7499999986, 产品主类: "服饰", 品牌: 'AAA'},
    {'sum(销售金额)': 277595, 产品主类: "服饰", 品牌: 'BBB'}],
    //颜色对象，包括feature, type, stacked这些key (该属性柱、线、或其组合不可用)
    colored: {},
    //标签数组 (该属性柱、线、或其组合不可用)
    labeled: ['sum(销售金额)'],
    //用户自定义颜色或大小范围
    range: {
      //每个aggression所对应的颜色范围[[], [], ...]，颜色为渐变时有
      color: [],
    },
    //行列数据
    column: {
      categories: ['产品主类', '品牌'],
      aggressions: []
    },
    row: {
      categories: [],
      aggressions: []
    },
  },
  //table
  table: {
    //外边框
    outter: {
      color: '#424242',
      width: 2
    },
    //内边框
    inner: {
      color: '#a4a4a4',
      width: 1
    },
    //边距
    padding: {
      top: 0, left: 0, bottom: 0, right: 5
    },
    //表头
    header: {
      top: {
        height: 35
      },
      left: {
        width: 100,
      },
      auto: false
    },
    //cell
    body: {
      width: 90,
      height: 24
    }
  },
}

export {table_config, table_config1, table_config2, table_config3}